pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_syntax.cpp
        GALGAS_string var_condition = var_conditionString.reader_string (SOURCE_FILE_AT_LINE (654)).reader_uppercaseString (SOURCE_FILE_AT_LINE (654)) ;
        const enumGalgasBool test_6 = GALGAS_bool (kIsEqual, var_condition.objectCompare (GALGAS_string ("Z"))).boolEnum () ;
        if (kBoolTrue == test_6) {
          var_skipIfSet = GALGAS_bool (true) ;
          GALGAS_string var_s = GALGAS_string ("if ! ").operator_concat (var_registerName.reader_mRegisterName (SOURCE_FILE_AT_LINE (657)).reader_string (SOURCE_FILE_AT_LINE (657)) COMMA_SOURCE_FILE_AT_LINE (657)) ;
          const enumGalgasBool test_7 = GALGAS_bool (kIsStrictSup, var_registerName.reader_mOffset (SOURCE_FILE_AT_LINE (658)).reader_uint (SOURCE_FILE_AT_LINE (658)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
          if (kBoolTrue == test_7) {
            var_s.dotAssign_operation (GALGAS_string (" [").operator_concat (var_registerName.reader_mOffset (SOURCE_FILE_AT_LINE (659)).reader_uint (SOURCE_FILE_AT_LINE (659)).reader_string (SOURCE_FILE_AT_LINE (659)) COMMA_SOURCE_FILE_AT_LINE (659)).operator_concat (GALGAS_string ("]") COMMA_SOURCE_FILE_AT_LINE (659)) COMMA_SOURCE_FILE_AT_LINE (659)) ;
          }
          var_s.dotAssign_operation (GALGAS_string (".") COMMA_SOURCE_FILE_AT_LINE (661)) ;
          callCategoryMethod_display ((const cPtr_bitNumberExpression *) var_bitNumber.ptr (), var_s, inCompiler COMMA_SOURCE_FILE_AT_LINE (661)) ;
          var_s.dotAssign_operation (GALGAS_string (" :") COMMA_SOURCE_FILE_AT_LINE (662)) ;
          GALGAS_location location_8 (var_conditionString.reader_location (HERE)) ; // Implicit use of 'location' reader
          inCompiler->emitSemanticWarning (location_8, GALGAS_string ("In Piccolo 1.2.0 and later, this construction is deprecated; use '").operator_concat (var_s COMMA_SOURCE_FILE_AT_LINE (663)).operator_concat (GALGAS_string ("' instead") COMMA_SOURCE_FILE_AT_LINE (663)) COMMA_SOURCE_FILE_AT_LINE (663)) ;
        }else if (kBoolFalse == test_6) {
          const enumGalgasBool test_9 = GALGAS_bool (kIsEqual, var_condition.objectCompare (GALGAS_string ("NZ"))).boolEnum () ;
          if (kBoolTrue == test_9) {
            var_skipIfSet = GALGAS_bool (false) ;
            GALGAS_string var_s = GALGAS_string ("if ").operator_concat (var_registerName.reader_mRegisterName (SOURCE_FILE_AT_LINE (666)).reader_string (SOURCE_FILE_AT_LINE (666)) COMMA_SOURCE_FILE_AT_LINE (666)) ;
            const enumGalgasBool test_10 = GALGAS_bool (kIsStrictSup, var_registerName.reader_mOffset (SOURCE_FILE_AT_LINE (667)).reader_uint (SOURCE_FILE_AT_LINE (667)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
            if (kBoolTrue == test_10) {
              var_s.dotAssign_operation (GALGAS_string (" [").operator_concat (var_registerName.reader_mOffset (SOURCE_FILE_AT_LINE (668)).reader_uint (SOURCE_FILE_AT_LINE (668)).reader_string (SOURCE_FILE_AT_LINE (668)) COMMA_SOURCE_FILE_AT_LINE (668)).operator_concat (GALGAS_string ("]") COMMA_SOURCE_FILE_AT_LINE (668)) COMMA_SOURCE_FILE_AT_LINE (668)) ;
            }
            var_s.dotAssign_operation (GALGAS_string (".") COMMA_SOURCE_FILE_AT_LINE (670)) ;
            callCategoryMethod_display ((const cPtr_bitNumberExpression *) var_bitNumber.ptr (), var_s, inCompiler COMMA_SOURCE_FILE_AT_LINE (670)) ;
            var_s.dotAssign_operation (GALGAS_string (" :") COMMA_SOURCE_FILE_AT_LINE (671)) ;
            GALGAS_location location_11 (var_conditionString.reader_location (HERE)) ; // Implicit use of 'location' reader
            inCompiler->emitSemanticWarning (location_11, GALGAS_string ("In Piccolo 1.2.0 and later, this construction is deprecated; use '").operator_concat (var_s COMMA_SOURCE_FILE_AT_LINE (672)).operator_concat (GALGAS_string ("' instead") COMMA_SOURCE_FILE_AT_LINE (672)) COMMA_SOURCE_FILE_AT_LINE (672)) ;
          }else if (kBoolFalse == test_9) {
            GALGAS_location location_12 (var_conditionString.reader_location (HERE)) ; // Implicit use of 'location' reader
            inCompiler->emitSemanticError (location_12, GALGAS_string ("invalid '").operator_concat (var_condition COMMA_SOURCE_FILE_AT_LINE (674)).operator_concat (GALGAS_string ("' condition; it should be 'z' or 'nz'") COMMA_SOURCE_FILE_AT_LINE (674)) COMMA_SOURCE_FILE_AT_LINE (674)) ;
            var_skipIfSet.drop () ; // Release error dropped variable
          }
        }
      } break ;
      default:
        break ;
      }
    } break ;
    default:
      break ;
    }
    //-------- @terminalCheckInstructionForGeneration
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken__3A_) COMMA_SOURCE_FILE_AT_LINE (678)) ;
    GALGAS_pic_31__38_PiccoloSimpleInstruction var_instruction ;
    //-------- @nonterminalInstructionForGeneration
    nt_simple_5F_instruction_ (var_instruction, inCompiler) ;
    outArgument_outInstruction = GALGAS_instruction_5F_IF_5F_BitTest::constructor_new (var_instructionLocation, var_instruction, var_skipIfSet, var_registerName, var_bitNumber COMMA_SOURCE_FILE_AT_LINE (680)) ;
  } break ;
  case 11: {
    //-------- @terminalCheckInstructionForGeneration
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_if) COMMA_SOURCE_FILE_AT_LINE (688)) ;
    GALGAS_location var_instructionLocation = inCompiler->here () ;
    GALGAS_bool var_increment ;
    //-------- @selectInstructionForGeneration
    switch (select_pic_31__38__5F_syntax_28 (inCompiler)) {
    case 1: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_decf) COMMA_SOURCE_FILE_AT_LINE (692)) ;
      var_increment = GALGAS_bool (false) ;
    } break ;
    case 2: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_incf) COMMA_SOURCE_FILE_AT_LINE (694)) ;
      var_increment = GALGAS_bool (true) ;
    } break ;
    default:
      break ;
    }
    GALGAS_registerExpression var_registerName ;
    //-------- @nonterminalInstructionForGeneration
    nt_register_5F_parsing_ (var_registerName, inCompiler) ;
    GALGAS_bool var_w_5F_isTarget ;
    //-------- @selectInstructionForGeneration
    switch (select_pic_31__38__5F_syntax_29 (inCompiler)) {
    case 1: {
      var_w_5F_isTarget = GALGAS_bool (false) ;
    } break ;
    case 2: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken__2C_) COMMA_SOURCE_FILE_AT_LINE (702)) ;
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_w) COMMA_SOURCE_FILE_AT_LINE (702)) ;
      var_w_5F_isTarget = GALGAS_bool (true) ;
    } break ;
    default:
      break ;
    }
    GALGAS_bool var_skipIfZero ;
    //-------- @terminalCheckInstructionForGeneration
    GALGAS_lstring var_conditionString = inCompiler->synthetizedAttribute_tokenString () ;
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_identifier) COMMA_SOURCE_FILE_AT_LINE (705)) ;
    GALGAS_string var_condition = var_conditionString.reader_string (SOURCE_FILE_AT_LINE (706)).reader_uppercaseString (SOURCE_FILE_AT_LINE (706)) ;
    const enumGalgasBool test_13 = GALGAS_bool (kIsEqual, var_condition.objectCompare (GALGAS_string ("Z"))).boolEnum () ;
    if (kBoolTrue == test_13) {
      var_skipIfZero = GALGAS_bool (false) ;
    }else if (kBoolFalse == test_13) {
      const enumGalgasBool test_14 = GALGAS_bool (kIsEqual, var_condition.objectCompare (GALGAS_string ("NZ"))).boolEnum () ;
      if (kBoolTrue == test_14) {
        var_skipIfZero = GALGAS_bool (true) ;
      }else if (kBoolFalse == test_14) {
        GALGAS_location location_15 (var_conditionString.reader_location (HERE)) ; // Implicit use of 'location' reader
        inCompiler->emitSemanticError (location_15, GALGAS_string ("invalid '").operator_concat (var_condition COMMA_SOURCE_FILE_AT_LINE (712)).operator_concat (GALGAS_string ("' condition; it should be 'z' or 'nz'") COMMA_SOURCE_FILE_AT_LINE (712)) COMMA_SOURCE_FILE_AT_LINE (712)) ;
        var_skipIfZero.drop () ; // Release error dropped variable
      }
    }
    //-------- @terminalCheckInstructionForGeneration
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken__3A_) COMMA_SOURCE_FILE_AT_LINE (714)) ;
    GALGAS_pic_31__38_PiccoloSimpleInstruction var_instruction ;
    //-------- @nonterminalInstructionForGeneration
    nt_simple_5F_instruction_ (var_instruction, inCompiler) ;
    outArgument_outInstruction = GALGAS_instruction_5F_IF_5F_IncDec::constructor_new (var_instructionLocation, var_instruction, var_increment, var_skipIfZero, var_registerName, var_w_5F_isTarget COMMA_SOURCE_FILE_AT_LINE (716)) ;
  } break ;
  case 12: {
    //-------- @terminalCheckInstructionForGeneration
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_if) COMMA_SOURCE_FILE_AT_LINE (725)) ;
    //-------- @nonterminalInstructionForGeneration
    nt_structured_5F_if_5F_instruction_ (outArgument_outInstruction, ioArgument_ioNeedsComputedGoto_32_, ioArgument_ioNeedsComputedGoto_34_, inCompiler) ;
    //-------- @terminalCheckInstructionForGeneration
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_end) COMMA_SOURCE_FILE_AT_LINE (731)) ;
  } break ;
  case 13: {
    //-------- @terminalCheckInstructionForGeneration
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_do) COMMA_SOURCE_FILE_AT_LINE (733)) ;
    GALGAS_location var_instructionLocation = inCompiler->here () ;
    GALGAS_instructionList var_repeatedInstructionList ;
    //-------- @nonterminalInstructionForGeneration
    nt_instruction_5F_list_ (var_repeatedInstructionList, ioArgument_ioNeedsComputedGoto_32_, ioArgument_ioNeedsComputedGoto_34_, inCompiler) ;
    GALGAS_location var_endOfRepeatedInstructionList = inCompiler->here () ;
    GALGAS_partList var_whilePartList = GALGAS_partList::constructor_emptyList (SOURCE_FILE_AT_LINE (742)) ;
    //-------- @repeatInstructionForGeneration
    bool repeatFlag_16 = true ;
    while (repeatFlag_16) {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_while) COMMA_SOURCE_FILE_AT_LINE (744)) ;
      GALGAS_conditionExpression var_whileCondition ;
      //-------- @nonterminalInstructionForGeneration
      nt_condition_5F_expression_ (var_whileCondition, inCompiler) ;
      GALGAS_instructionList var_instructionList ;
      //-------- @nonterminalInstructionForGeneration
      nt_instruction_5F_list_ (var_instructionList, ioArgument_ioNeedsComputedGoto_32_, ioArgument_ioNeedsComputedGoto_34_, inCompiler) ;
      var_whilePartList.addAssign_operation (var_whileCondition, var_instructionList, inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (753)) ;
      switch (select_pic_31__38__5F_syntax_30 (inCompiler)) {
      case 2: {
      } break ;
      default:
        repeatFlag_16 = false ;
        break ;
      }
    }
    //-------- @terminalCheckInstructionForGeneration
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_end) COMMA_SOURCE_FILE_AT_LINE (756)) ;
    outArgument_outInstruction = GALGAS_instruction_5F_do_5F_while::constructor_new (var_instructionLocation, var_repeatedInstructionList, var_endOfRepeatedInstructionList, var_whilePartList COMMA_SOURCE_FILE_AT_LINE (757)) ;
  } break ;
  case 14: {
    //-------- @terminalCheckInstructionForGeneration
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_mnop) COMMA_SOURCE_FILE_AT_LINE (764)) ;
    GALGAS_location var_instructionLocation = inCompiler->here () ;
    //-------- @terminalCheckInstructionForGeneration
    GALGAS_luint var_occurrenceFactor = inCompiler->synthetizedAttribute_uint_33__32_value () ;
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_integer) COMMA_SOURCE_FILE_AT_LINE (766)) ;
    outArgument_outInstruction = GALGAS_instruction_5F_MNOP::constructor_new (var_instructionLocation, var_occurrenceFactor COMMA_SOURCE_FILE_AT_LINE (767)) ;
  } break ;
  case 15: {
    GALGAS_conditional_5F_branch var_condition ;
    //-------- @selectInstructionForGeneration
    switch (select_pic_31__38__5F_syntax_31 (inCompiler)) {
    case 1: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_bc) COMMA_SOURCE_FILE_AT_LINE (771)) ;
      var_condition = GALGAS_conditional_5F_branch::constructor_bc (SOURCE_FILE_AT_LINE (771)) ;
    } break ;
    case 2: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_bnc) COMMA_SOURCE_FILE_AT_LINE (773)) ;
      var_condition = GALGAS_conditional_5F_branch::constructor_bnc (SOURCE_FILE_AT_LINE (773)) ;
    } break ;
    case 3: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_bn) COMMA_SOURCE_FILE_AT_LINE (775)) ;
      var_condition = GALGAS_conditional_5F_branch::constructor_bn (SOURCE_FILE_AT_LINE (775)) ;
    } break ;
    case 4: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_bnn) COMMA_SOURCE_FILE_AT_LINE (777)) ;
      var_condition = GALGAS_conditional_5F_branch::constructor_bnn (SOURCE_FILE_AT_LINE (777)) ;
    } break ;
    case 5: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_bov) COMMA_SOURCE_FILE_AT_LINE (779)) ;
      var_condition = GALGAS_conditional_5F_branch::constructor_bov (SOURCE_FILE_AT_LINE (779)) ;
    } break ;
    case 6: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_bnov) COMMA_SOURCE_FILE_AT_LINE (781)) ;
      var_condition = GALGAS_conditional_5F_branch::constructor_bnov (SOURCE_FILE_AT_LINE (781)) ;
    } break ;
    case 7: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_bz) COMMA_SOURCE_FILE_AT_LINE (783)) ;
      var_condition = GALGAS_conditional_5F_branch::constructor_bz (SOURCE_FILE_AT_LINE (783)) ;
    } break ;
    case 8: {
      //-------- @terminalCheckInstructionForGeneration
      inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_bnz) COMMA_SOURCE_FILE_AT_LINE (785)) ;
      var_condition = GALGAS_conditional_5F_branch::constructor_bnz (SOURCE_FILE_AT_LINE (785)) ;
    } break ;
    default:
      break ;
    }
    GALGAS_location var_instructionLocation = inCompiler->here () ;
    //-------- @terminalCheckInstructionForGeneration
    GALGAS_lstring var_targetLabelName = inCompiler->synthetizedAttribute_tokenString () ;
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_identifier) COMMA_SOURCE_FILE_AT_LINE (788)) ;
    outArgument_outInstruction = GALGAS_instruction_5F_JUMPCC::constructor_new (var_instructionLocation, var_targetLabelName, var_condition, GALGAS_bool (true) COMMA_SOURCE_FILE_AT_LINE (789)) ;
  } break ;
  case 16: {
    //-------- @terminalCheckInstructionForGeneration
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_jump) COMMA_SOURCE_FILE_AT_LINE (796)) ;
    GALGAS_location var_instructionLocation = inCompiler->here () ;
    GALGAS_conditional_5F_branch var_conditional_5F_branch ;
    //-------- @terminalCheckInstructionForGeneration
    GALGAS_lstring var_conditionString = inCompiler->synthetizedAttribute_tokenString () ;
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_identifier) COMMA_SOURCE_FILE_AT_LINE (799)) ;
    GALGAS_string var_condition = var_conditionString.reader_string (SOURCE_FILE_AT_LINE (800)).reader_uppercaseString (SOURCE_FILE_AT_LINE (800)) ;
    const enumGalgasBool test_17 = GALGAS_bool (kIsEqual, var_condition.objectCompare (GALGAS_string ("Z"))).boolEnum () ;
    if (kBoolTrue == test_17) {
      var_conditional_5F_branch = GALGAS_conditional_5F_branch::constructor_bz (SOURCE_FILE_AT_LINE (802)) ;
    }else if (kBoolFalse == test_17) {
      const enumGalgasBool test_18 = GALGAS_bool (kIsEqual, var_condition.objectCompare (GALGAS_string ("NZ"))).boolEnum () ;
      if (kBoolTrue == test_18) {
        var_conditional_5F_branch = GALGAS_conditional_5F_branch::constructor_bnz (SOURCE_FILE_AT_LINE (804)) ;
      }else if (kBoolFalse == test_18) {
        const enumGalgasBool test_19 = GALGAS_bool (kIsEqual, var_condition.objectCompare (GALGAS_string ("NN"))).boolEnum () ;
        if (kBoolTrue == test_19) {
          var_conditional_5F_branch = GALGAS_conditional_5F_branch::constructor_bnn (SOURCE_FILE_AT_LINE (806)) ;
        }else if (kBoolFalse == test_19) {
          const enumGalgasBool test_20 = GALGAS_bool (kIsEqual, var_condition.objectCompare (GALGAS_string ("N"))).boolEnum () ;
          if (kBoolTrue == test_20) {
            var_conditional_5F_branch = GALGAS_conditional_5F_branch::constructor_bn (SOURCE_FILE_AT_LINE (808)) ;
          }else if (kBoolFalse == test_20) {
            const enumGalgasBool test_21 = GALGAS_bool (kIsEqual, var_condition.objectCompare (GALGAS_string ("C"))).boolEnum () ;
            if (kBoolTrue == test_21) {
              var_conditional_5F_branch = GALGAS_conditional_5F_branch::constructor_bc (SOURCE_FILE_AT_LINE (810)) ;
            }else if (kBoolFalse == test_21) {
              const enumGalgasBool test_22 = GALGAS_bool (kIsEqual, var_condition.objectCompare (GALGAS_string ("NC"))).boolEnum () ;
              if (kBoolTrue == test_22) {
                var_conditional_5F_branch = GALGAS_conditional_5F_branch::constructor_bnc (SOURCE_FILE_AT_LINE (812)) ;
              }else if (kBoolFalse == test_22) {
                const enumGalgasBool test_23 = GALGAS_bool (kIsEqual, var_condition.objectCompare (GALGAS_string ("OV"))).boolEnum () ;
                if (kBoolTrue == test_23) {
                  var_conditional_5F_branch = GALGAS_conditional_5F_branch::constructor_bov (SOURCE_FILE_AT_LINE (814)) ;
                }else if (kBoolFalse == test_23) {
                  const enumGalgasBool test_24 = GALGAS_bool (kIsEqual, var_condition.objectCompare (GALGAS_string ("NOV"))).boolEnum () ;
                  if (kBoolTrue == test_24) {
                    var_conditional_5F_branch = GALGAS_conditional_5F_branch::constructor_bnov (SOURCE_FILE_AT_LINE (816)) ;
                  }else if (kBoolFalse == test_24) {
                    GALGAS_location location_25 (var_conditionString.reader_location (HERE)) ; // Implicit use of 'location' reader
                    inCompiler->emitSemanticError (location_25, GALGAS_string ("invalid '").operator_concat (var_conditionString.reader_string (SOURCE_FILE_AT_LINE (818)) COMMA_SOURCE_FILE_AT_LINE (818)).operator_concat (GALGAS_string ("' condition; valid ones are: 'z', 'nz', 'n', 'nn', 'c', 'nc', 'ov' and 'nov'") COMMA_SOURCE_FILE_AT_LINE (819)) COMMA_SOURCE_FILE_AT_LINE (818)) ;
                    var_conditional_5F_branch.drop () ; // Release error dropped variable
                  }
                }
              }
            }
          }
        }
      }
    }
    //-------- @terminalCheckInstructionForGeneration
    GALGAS_lstring var_targetLabelName = inCompiler->synthetizedAttribute_tokenString () ;
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_identifier) COMMA_SOURCE_FILE_AT_LINE (823)) ;
    outArgument_outInstruction = GALGAS_instruction_5F_JUMPCC::constructor_new (var_instructionLocation, var_targetLabelName, var_conditional_5F_branch, GALGAS_bool (false) COMMA_SOURCE_FILE_AT_LINE (824)) ;
  } break ;
  case 17: {
    //-------- @terminalCheckInstructionForGeneration
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_jump) COMMA_SOURCE_FILE_AT_LINE (831)) ;
    GALGAS_location var_instructionLocation = inCompiler->here () ;
    //-------- @terminalCheckInstructionForGeneration
    GALGAS_lstring var_targetLabelName = inCompiler->synthetizedAttribute_tokenString () ;
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_identifier) COMMA_SOURCE_FILE_AT_LINE (833)) ;
    outArgument_outInstruction = GALGAS_instruction_5F_JUMP::constructor_new (var_instructionLocation, var_targetLabelName, GALGAS_jumpInstructionKind::constructor_ipicRelative (SOURCE_FILE_AT_LINE (837)) COMMA_SOURCE_FILE_AT_LINE (834)) ;
  } break ;
  case 18: {
    //-------- @terminalCheckInstructionForGeneration
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_goto) COMMA_SOURCE_FILE_AT_LINE (840)) ;
    GALGAS_location var_instructionLocation = inCompiler->here () ;
    //-------- @terminalCheckInstructionForGeneration
    GALGAS_lstring var_targetLabelName = inCompiler->synthetizedAttribute_tokenString () ;
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_identifier) COMMA_SOURCE_FILE_AT_LINE (842)) ;
    outArgument_outInstruction = GALGAS_instruction_5F_JUMP::constructor_new (var_instructionLocation, var_targetLabelName, GALGAS_jumpInstructionKind::constructor_absolute (SOURCE_FILE_AT_LINE (846)) COMMA_SOURCE_FILE_AT_LINE (843)) ;
  } break ;
  case 19: {
    //-------- @terminalCheckInstructionForGeneration
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_bra) COMMA_SOURCE_FILE_AT_LINE (849)) ;
    GALGAS_location var_instructionLocation = inCompiler->here () ;
    //-------- @terminalCheckInstructionForGeneration
    GALGAS_lstring var_targetLabelName = inCompiler->synthetizedAttribute_tokenString () ;
    inCompiler->acceptTerminal (ACCEPT_TERMINAL (C_Lexique_piccolo_5F_lexique::kToken_identifier) COMMA_SOURCE_FILE_AT_LINE (851)) ;
    outArgument_outInstruction = GALGAS_instruction_5F_JUMP::constructor_new (var_instructionLocation, var_targetLabelName, GALGAS_jumpInstructionKind::constructor_relative (SOURCE_FILE_AT_LINE (855)) COMMA_SOURCE_FILE_AT_LINE (852)) ;
  } break ;
  default:
    break ;
  }
}

//---------------------------------------------------------------------------*

